<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"7117d9beaeebe2b26e0707f9774a548cb668319cdf8ceb6a2bfc984ff5c905c0","plan_job_ref":"Job Test terraform-refresh #63 at https://github.com/dflook/terraform-github-actions/actions/runs/16658287155","plan_out_hash":"8281c68c1229cf2c1279499b6407506eda721abdc27188c7b3ed89e6674aa770","plan_hash":"a0f072c936d6f69f6c208a193511277008170e30ee410cfc9ed945bd516c8b0e","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #63](https://github.com/dflook/terraform-github-actions/actions/runs/16658287155)